Tekla Open API Reference for Tekla Structures 2025
RebarSet Properties
The RebarSet type exposes the following members.
Properties
Name | Description
BarOrientation
 Gets or sets the bar orientation line. If this is non-null, then it is used to orient the bar planes such that the line is parallel to all the planes.
CloseShape
 Gets or sets a value indicating whether disconnected bar legs should be connected where possible to form a closed shape.
FatherPart
 Gets or sets the father part for the rebar set bars. If set, overrides the automatic bar parenting.
Guidelines
 Gets or sets the rebar set's guidelines.
Identifier
 The identifier of the object.
 (Inherited from Object.)
IsUpToDate
Gets if the object does not have a modification which is not shared.
 (Inherited from ModelObject.)
LayerOrderNumber
 Gets or sets the layer order number. If set to 0 this means use the creation date/time of the rebar set object to determine the layering.
LegFaces
 Gets or sets the rebar set's leg faces.
ModificationTime
Gets latest time of the object was modified or created.
 (Inherited from ModelObject.)
RebarProperties
 Gets or sets the reinforcing bar properties for the rebar set.
Top
See Also
Reference
RebarSet Class
Tekla.Structures.Model Namespace